andylee830914/esp-thread-probe/firmware/uplink-wroom32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_UPLINK_HTTP_PORT=80
CONFIG_UPLINK_UART_NUM=1
CONFIG_UPLINK_UART_TX_GPIO=17
CONFIG_UPLINK_UART_RX_GPIO=16
CONFIG_UPLINK_UART_BAUD=115200
CONFIG_UPLINK_PROBE_TIMEOUT_MS=2500
